In [10]:
import pandas as pd
import numpy as np

In [2]:
data = {'name' : ['Alice','Bob', 'Charlie'], 'age' : [16, 21, 18]}
df = pd.DataFrame(data)

In [3]:
df.head()

      name  age
0    Alice   16
1      Bob   21
2  Charlie   18

In [5]:
df['gender'] = 'male'
df.head()

      name  age gender
0    Alice   16   male
1      Bob   21   male
2  Charlie   18   male

In [8]:
df.loc[2] = ['Charlie', 18, 'male']
df.head()

      name  age gender
0    Alice   16   male
1      Bob   21   male
2  Charlie   18   male
3    Chris   30   male

In [11]:
df.loc[4] = ['Nina', np.nan, 'female']
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0    male
4     Nina   NaN  female

In [12]:
df.loc[3,'gender'] = np.nan
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0     NaN
4     Nina   NaN  female

In [14]:
df['age'].fillna(26)

0    16.0
1    21.0
2    18.0
3    30.0
4    26.0
Name: age, dtype: float64

In [15]:
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0     NaN
4     Nina   NaN  female

In [16]:
df['age'].fillna(26, inplace = True)
df.head()
#for changing value in the memory

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0     NaN
4     Nina  26.0  female

In [17]:
df['gender'].fillna('female', inplace = True)
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0  female
4     Nina  26.0  female

In [18]:
df.loc[4] = ['Nina', np.nan, 'female']
df.loc[3,'gender'] = np.nan
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0     NaN
4     Nina   NaN  female

In [19]:
df.dropna()

      name   age gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [20]:
df.head()

      name   age  gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3    Chris  30.0     NaN
4     Nina   NaN  female

In [21]:
df.dropna(inplace = True) #to change in the memory
df.head()

      name   age gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [22]:
df.drop('gender', axis = 1)

      name   age
0    Alice  16.0
1      Bob  21.0
2  Charlie  18.0

In [23]:
df.drop(1,axis=0)

      name   age gender
0    Alice  16.0   male
2  Charlie  18.0   male

In [24]:
df.reset_index()

   index     name   age gender
0      0    Alice  16.0   male
1      1      Bob  21.0   male
2      2  Charlie  18.0   male

In [25]:
df.reset_index().drop('index', axis=1, inplace = True)
df.head()

      name   age gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [27]:
# df.reset_index().drop('index', axis=1, inplace = True)
df.reset_index(drop = True) 

#this is same

      name   age gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [28]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [31]:
col_mapper = {'name':'Name', 'age':'Age', 'gender': 'Gender'}

In [33]:
df.rename(columns = col_mapper)

      Name   Age Gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [34]:
df.head()

      name   age gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [35]:
df.rename(columns = col_mapper, inplace = True)
df.head()

      Name   Age Gender
0    Alice  16.0   male
1      Bob  21.0   male
2  Charlie  18.0   male

In [36]:
def double(x):
    return x * 2

In [38]:
df['Age'].apply(double)

0    32.0
1    42.0
2    36.0
Name: Age, dtype: float64

In [39]:
df.loc[3] = ['Jane', 20, 'Female']
df.loc[4] = ['Ruth', 28, 'Female']
df.head()

      Name   Age  Gender
0    Alice  16.0    male
1      Bob  21.0    male
2  Charlie  18.0    male
3     Jane  20.0  Female
4     Ruth  28.0  Female

In [42]:
grouped_df = df.groupby('Gender')

In [44]:
grouped_df.agg({'Age': 'mean'})

              Age
Gender
Female  24.000000
male    18.333333

In [ ]:
grouped_df = df.groupby('Gender')